# Official repository packages for the VM profile.
# Keep this VM-friendly: no physical GPU drivers or machine-specific firmware.

base-devel
git
curl
wget
ca-certificates
sudo

networkmanager
pipewire
pipewire-pulse
wireplumber

fish
starship
kitty
niri
fuzzel
xwayland-satellite
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
polkit-gnome
sddm
qt6-declarative
qt6-svg
qt6-multimedia
qt6ct
kimageformats
nautilus
loupe
xdg-user-dirs
open-vm-tools
gtkmm3
matugen
cava
power-profiles-daemon
wtype
cups-pk-helper

fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
fcitx5-rime
fcitx5-chinese-addons

neovim
neovide
tree-sitter-cli
fd
fzf
ripgrep
eza
jq
unzip
glow
yazi
xdg-utils
mpv
yt-dlp
libnotify
poppler
poppler-glib
wl-clipboard
xclip
fastfetch
flatpak
pacman-contrib
reflector
upower
strace
pciutils
mesa-utils
vulkan-tools
tesseract
tesseract-data-chi_sim
tesseract-data-chi_sim_vert
tesseract-data-eng
tesseract-data-osd

nodejs
npm
go
rust
python
python-pip
jdk-openjdk
clang
shellcheck

ttf-jetbrains-mono-nerd
inter-font
ttf-fira-code
ttf-dejavu
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
