# Official repository packages for the VM profile.
# Keep this VM-friendly: no physical GPU drivers, laptop battery tools, or machine-specific firmware.

base-devel
git
curl
wget
ca-certificates
sudo

networkmanager
pipewire
pipewire-pulse
wireplumber

fish
starship
kitty
niri
mako
fuzzel
xwayland-satellite
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
polkit-gnome
nautilus
loupe

fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
fcitx5-rime

neovim
neovide
tree-sitter-cli
fd
fzf
ripgrep
eza
jq
unzip
glow
yazi
xdg-utils
mpv
yt-dlp
wl-clipboard
xclip
fastfetch

nodejs
npm
go
python
jdk-openjdk
clang
shellcheck

ttf-jetbrains-mono-nerd
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
